dfe-stubs/src/main/resources/wsdl/cte/mg/prod/return_reception.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.2-1 git-revision#dbe58a8. --><!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 2.3.2-1 git-revision#dbe58a8. -->
<definitions
        xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
        xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
        xmlns:tns="http://www.portalfiscal.inf.br/cte/wsdl/CteRetRecepcao"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
        targetNamespace="http://www.portalfiscal.inf.br/cte/wsdl/CteRetRecepcao" name="CteRetRecepcao">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://www.portalfiscal.inf.br/cte/wsdl/CteRetRecepcao"
                        schemaLocation="https://cte.fazenda.mg.gov.br:443/cte/services/CteRetRecepcao?xsd=1"/>
        </xsd:schema>
    </types>
    <message name="cteRetRecepcao">
        <part name="cteDadosMsg" element="tns:cteDadosMsg"/>
        <part name="cteCabecMsg" element="tns:cteCabecMsg"/>
    </message>
    <message name="cteRetRecepcaoResponse">
        <part name="cteRetRecepcaoResult" element="tns:cteRetRecepcaoResult"/>
        <part name="cteCabecMsg" element="tns:cteCabecMsg"/>
    </message>
    <portType name="CteRetRecepcaoSoap12">
        <operation name="cteRetRecepcao" parameterOrder="cteDadosMsg cteCabecMsg">
            <input wsam:Action="http://www.portalfiscal.inf.br/cte/wsdl/CteRetRecepcao/cteRetRecepcao"
                   message="tns:cteRetRecepcao"/>
            <output wsam:Action="http://www.portalfiscal.inf.br/cte/wsdl/CteRetRecepcao/CteRetRecepcaoSoap12/cteRetRecepcaoResponse"
                    message="tns:cteRetRecepcaoResponse"/>
        </operation>
    </portType>
    <binding name="CteRetRecepcaoSoap12Binding" type="tns:CteRetRecepcaoSoap12">
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="cteRetRecepcao">
            <soap12:operation soapAction="http://www.portalfiscal.inf.br/cte/wsdl/CteRetRecepcao/cteRetRecepcao"/>
            <input>
                <soap12:body use="literal" parts="cteDadosMsg"/>
                <soap12:header message="tns:cteRetRecepcao" part="cteCabecMsg" use="literal"/>
            </input>
            <output>
                <soap12:body use="literal" parts="cteRetRecepcaoResult"/>
                <soap12:header message="tns:cteRetRecepcaoResponse" part="cteCabecMsg" use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="CteRetRecepcao">
        <port name="CteRetRecepcaoSoap12" binding="tns:CteRetRecepcaoSoap12Binding">
            <soap12:address location="https://cte.fazenda.mg.gov.br:443/cte/services/CteRetRecepcao"/>
        </port>
    </service>
</definitions>